/**********************************/
/*头文件定义header file definition*/
/**********************************/
#ifndef  __FOLLOW_WIND_FIRE_H__
#define  __FOLLOW_WIND_FIRE_H__

/*******************/
/*头文件header file*/
/*******************/
#include "app_main.h"

/************************/
/*宏定义macro definition*/
/************************/
#define FOLLOW_WIND_FRAME    113
#define WVA1                 0x0A  //DEC:10     follow_wind_fire_value_1
#define WVA2                 0x1E  //DEC:30     follow_wind_fire_value_2
#define WVA3                 0x32  //DEC:50     follow_wind_fire_value_3
#define WVA4                 0x50  //DEC:80     follow_wind_fire_value_4
#define WVA5                 0x6E  //DEC:110    follow_wind_fire_value_5
#define WVA6                 0x96  //DEC:150    follow_wind_fire_value_6

/*************************/
/*类型定义byte definition*/
/*************************/

/****************************/
/*标志位定义flags definetion*/
/****************************/

/*****************************/
/*变量定义variable definition*/
/*****************************/

/**************************/
/*数组定义array definition*/
/**************************/

/******************************/
/*函数声明Function declaration*/
/******************************/

/****************************/
/*函数定义function definetion*/
/****************************/

/********************************/
/*外部调用_宏定义macro definition*/
/********************************/

/*********************************/
/*外部调用_类型定义byte definition*/
/*********************************/

/************************************/
/*外部调用_标志位定义flags definetion*/
/************************************/

/*************************************/
/*外部调用_变量定义variable definition*/
/*************************************/

/**********************************/
/*外部调用_数组定义array definition*/
/**********************************/


/**************************************/
/*外部调用_函数声明Function declaration*/
/**************************************/

/*************************************/
/*外部调用_函数定义function definetion*/
/*************************************/
extern void Follow_Wind_Fire_Mode(void);

#endif



