/**********************************/
/*头文件定义header file definition*/
/**********************************/
#ifndef  __SN3236_H__
#define  __SN3236_H__

/*******************/
/*头文件header file*/
/*******************/
#include "app_main.h"

/************************/
/*宏定义macro definition*/
/************************/
#define REG_00H_TURN_ON        0x00
#define REG_01H_PWM_START      0x01
#define REG_25H_UPDATE         0x25
#define REG_26H_PWM_CONTROL    0x26
#define REG_4AH_GLOBAL_CONTROL 0x4A

/*************************/
/*类型定义byte definition*/
/*************************/

/****************************/
/*标志位定义flags definetion*/
/****************************/

/*****************************/
/*变量定义variable definition*/
/*****************************/

/**************************/
/*数组定义array definition*/
/**************************/

/******************************/
/*函数声明Function declaration*/
/******************************/
void SN3236_Driver(void);

/****************************/
/*函数定义function definetion*/
/****************************/

/********************************/
/*外部调用_宏定义macro definition*/
/********************************/

/*********************************/
/*外部调用_类型定义byte definition*/
/*********************************/

/************************************/
/*外部调用_标志位定义flags definetion*/
/************************************/

/*************************************/
/*外部调用_变量定义variable definition*/
/*************************************/

/**********************************/
/*外部调用_数组定义array definition*/
/**********************************/
extern u8 SN3236_Pwm2_1[36];
extern u8 SN3236_Pwm2_2[36];
extern u8 SN3236_RegBuffer[0x4B];

/**************************************/
/*外部调用_函数声明Function declaration*/
/**************************************/

/*************************************/
/*外部调用_函数定义function definetion*/
/*************************************/


#endif























